#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cloud_composer.google_project_service.composer_api: Refreshing state... [id=dtc-dataops-dev-366316/composer.googleapis.com]
google_service_account.airflow: Refreshing state... [id=projects/dtc-dataops-dev-366316/serviceAccounts/airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
module.cloud_composer.google_service_account.cloud_composer_service_account: Refreshing state... [id=projects/dtc-dataops-dev-366316/serviceAccounts/composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
google_project_service.enable_compute_api: Refreshing state... [id=dtc-dataops-dev-366316/compute.googleapis.com]
module.nyc_taxi_data_lake.google_storage_bucket.gcp_bucket: Refreshing state... [id=nyc-taxi-dev-dtc-dataops-dev-366316]
google_bigquery_dataset.big_query: Refreshing state... [id=projects/dtc-dataops-dev-366316/datasets/trips_data_all]
module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/bigquery.dataEditor"]: Refreshing state... [id=dtc-dataops-dev-366316/roles/bigquery.dataEditor/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/composer.worker"]: Refreshing state... [id=dtc-dataops-dev-366316/roles/composer.worker/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/iam.serviceAccountUser"]: Refreshing state... [id=dtc-dataops-dev-366316/roles/iam.serviceAccountUser/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/storage.objectAdmin"]: Refreshing state... [id=dtc-dataops-dev-366316/roles/storage.objectAdmin/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
google_project_iam_member.airflow["roles/bigquery.dataEditor"]: Refreshing state... [id=dtc-dataops-dev-366316/roles/bigquery.dataEditor/serviceAccount:airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
google_project_iam_member.airflow["roles/storage.objectAdmin"]: Refreshing state... [id=dtc-dataops-dev-366316/roles/storage.objectAdmin/serviceAccount:airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_project_iam_member.airflow["roles/bigquery.dataEditor"] has changed
  ~ resource "google_project_iam_member" "airflow" {
      ~ etag    = "BwXsbibBeck=" -> "BwXsmydsB94="
        id      = "dtc-dataops-dev-366316/roles/bigquery.dataEditor/serviceAccount:airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.airflow["roles/storage.objectAdmin"] has changed
  ~ resource "google_project_iam_member" "airflow" {
      ~ etag    = "BwXsbibBeck=" -> "BwXsmydsB94="
        id      = "dtc-dataops-dev-366316/roles/storage.objectAdmin/serviceAccount:airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/bigquery.dataEditor"] has changed
  ~ resource "google_project_iam_member" "cloud_composer_iam" {
      ~ etag    = "BwXsmycuMjw=" -> "BwXsmydsB94="
        id      = "dtc-dataops-dev-366316/roles/bigquery.dataEditor/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/composer.worker"] has changed
  ~ resource "google_project_iam_member" "cloud_composer_iam" {
      ~ etag    = "BwXsmycuMjw=" -> "BwXsmydsB94="
        id      = "dtc-dataops-dev-366316/roles/composer.worker/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/iam.serviceAccountUser"] has changed
  ~ resource "google_project_iam_member" "cloud_composer_iam" {
      ~ etag    = "BwXsmycuMjw=" -> "BwXsmydsB94="
        id      = "dtc-dataops-dev-366316/roles/iam.serviceAccountUser/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/storage.objectAdmin"] has changed
  ~ resource "google_project_iam_member" "cloud_composer_iam" {
      ~ etag    = "BwXsmycuMjw=" -> "BwXsmydsB94="
        id      = "dtc-dataops-dev-366316/roles/storage.objectAdmin/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "cloud-composer-network-dev"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.cloud_composer.google_composer_environment.cloud_composer will be created
  + resource "google_composer_environment" "cloud_composer" {
      + id      = (known after apply)
      + name    = "dtc-cloud-composer-dev"
      + project = "dtc-dataops-dev-366316"
      + region  = "us-west1"

      + config {
          + airflow_uri      = (known after apply)
          + dag_gcs_prefix   = (known after apply)
          + environment_size = "ENVIRONMENT_SIZE_SMALL"
          + gke_cluster      = (known after apply)
          + node_count       = (known after apply)

          + database_config {
              + machine_type = (known after apply)
            }

          + encryption_config {
              + kms_key_name = (known after apply)
            }

          + maintenance_window {
              + end_time   = (known after apply)
              + recurrence = (known after apply)
              + start_time = (known after apply)
            }

          + node_config {
              + disk_size_gb         = (known after apply)
              + enable_ip_masq_agent = (known after apply)
              + ip_allocation_policy = (known after apply)
              + machine_type         = (known after apply)
              + network              = (known after apply)
              + oauth_scopes         = (known after apply)
              + service_account      = "projects/dtc-dataops-dev-366316/serviceAccounts/composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
              + subnetwork           = (known after apply)
              + zone                 = (known after apply)
            }

          + private_environment_config {
              + cloud_composer_connection_subnetwork   = (known after apply)
              + cloud_composer_network_ipv4_cidr_block = (known after apply)
              + cloud_sql_ipv4_cidr_block              = (known after apply)
              + enable_private_endpoint                = (known after apply)
              + enable_privately_used_public_ips       = (known after apply)
              + master_ipv4_cidr_block                 = (known after apply)
              + web_server_ipv4_cidr_block             = (known after apply)
            }

          + software_config {
              + airflow_config_overrides = {
                  + "core-dags_are_paused_at_creation" = "True"
                }
              + image_version            = "composer-2.0.30-airflow-2.3.3"
              + python_version           = (known after apply)
              + scheduler_count          = (known after apply)
            }

          + web_server_config {
              + machine_type = (known after apply)
            }

          + web_server_network_access_control {
              + allowed_ip_range {
                  + description = (known after apply)
                  + value       = (known after apply)
                }
            }

          + workloads_config {
              + scheduler {
                  + count      = (known after apply)
                  + cpu        = (known after apply)
                  + memory_gb  = (known after apply)
                  + storage_gb = (known after apply)
                }

              + web_server {
                  + cpu        = (known after apply)
                  + memory_gb  = (known after apply)
                  + storage_gb = (known after apply)
                }

              + worker {
                  + cpu        = (known after apply)
                  + max_count  = (known after apply)
                  + memory_gb  = (known after apply)
                  + min_count  = (known after apply)
                  + storage_gb = (known after apply)
                }
            }
        }
    }

  # module.cloud_composer.google_compute_subnetwork.cloud_composer_subnet will be created
  + resource "google_compute_subnetwork" "cloud_composer_subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.2.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "cloud-composer-subnet-dev"
      + network                    = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "us-west1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.cloud_composer.google_service_account_iam_member.cloud_composer_iam_binding will be created
  + resource "google_service_account_iam_member" "cloud_composer_iam_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:service-523776208646@cloudcomposer-accounts.iam.gserviceaccount.com"
      + role               = "roles/composer.ServiceAgentV2Ext"
      + service_account_id = "projects/dtc-dataops-dev-366316/serviceAccounts/composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @djcurill, Action: `pull_request`*